
pandas

    pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.
    Python with Pandas is used in a wide range of fields including academic and commercial domains including finance, economics, Statistics, analytics, etc.
    Panel Data â€“ an Econometrics from Multidimensional data.
    In 2008, developer Wes McKinney started developing pandas when in need of high performance, flexible tool for analysis of data.

In [1]:
pip show pandas

Name: pandas
Version: 1.2.4
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: /home/pratiksha/anaconda3/lib/python3.8/site-packages
Requires: python-dateutil, pytz, numpy
Required-by: statsmodels, seaborn
Note: you may need to restart the kernel to use updated packages.

In [45]:
import pandas as pd
import numpy as np

In [43]:
#creating a dataframe using dictionary
#dictionary initialized inside a function
df = pd.DataFrame(
{
    "Name":[
        "Saurabh",
        "Pari",
        "Rohini",
        "Rahul",
    ],
    "Age":[20,19,22,19],
    "Sex":["male","female","female","male"],
}
)
#printing dataframe without title
df

      Name  Age     Sex
0  Saurabh   20    male
1     Pari   19  female
2   Rohini   22  female
3    Rahul   19    male

In [4]:
#printing dataframe with title
df.style.set_caption("Friends")

In [5]:
#creating a dataframe using dictionary
#dictionary initialized seperatally
Friends= {
    "Name":["Saurabh","Pari","Rohini","Rahul"],
    "Age":[20,19,22,19],
    "Sex":["male","female","female","male"],
}

In [6]:
df=pd.DataFrame(Friends)

In [7]:
df

      Name  Age     Sex
0  Saurabh   20    male
1     Pari   19  female
2   Rohini   22  female
3    Rahul   19    male

In [8]:
df.columns

Index(['Name', 'Age', 'Sex'], dtype='object')

In [9]:
df.shape

(4, 3)

In [10]:
df.size

12

In [11]:
#By default head( ) shows first 5 rows.
#You can specify the number of rows
df.head()

      Name  Age     Sex
0  Saurabh   20    male
1     Pari   19  female
2   Rohini   22  female
3    Rahul   19    male

In [12]:
df.head(2)

      Name  Age     Sex
0  Saurabh   20    male
1     Pari   19  female

In [13]:
#By default tail( ) shows last 5 rows.
df.tail()

      Name  Age     Sex
0  Saurabh   20    male
1     Pari   19  female
2   Rohini   22  female
3    Rahul   19    male

In [14]:
df.tail(2)

     Name  Age     Sex
2  Rohini   22  female
3   Rahul   19    male

In [15]:
#It shows one and two rows
df1=df[1:3]
df1

     Name  Age     Sex
1    Pari   19  female
2  Rohini   22  female

In [16]:
#It still remain same
df

      Name  Age     Sex
0  Saurabh   20    male
1     Pari   19  female
2   Rohini   22  female
3    Rahul   19    male

In [17]:
# how to select specific Columns also change the order of columns
new_df = df[['Age','Name']]
new_df

   Age     Name
0   20  Saurabh
1   19     Pari
2   22   Rohini
3   19    Rahul

In [18]:
# how to see values from specific column
df['Name']

0    Saurabh
1       Pari
2     Rohini
3      Rahul
Name: Name, dtype: object

In [39]:
df.Name

0    Saurabh
1       Pari
2     Rohini
3      Rahul
Name: Name, dtype: object

In [19]:
df2=df['Age']

In [20]:
df2

0    20
1    19
2    22
3    19
Name: Age, dtype: int64

In [21]:
df2.min()

19

In [22]:
df2.max()

22

In [23]:
df2.mean()

20.0

In [24]:
df

      Name  Age     Sex
0  Saurabh   20    male
1     Pari   19  female
2   Rohini   22  female
3    Rahul   19    male

In [25]:
# Display records where age is greater than 19 - Just like SQL Statements
high_age = df[df['Age']>19]
high_age

      Name  Age     Sex
0  Saurabh   20    male
2   Rohini   22  female

In [26]:
# Display day where Age is less than 20 - Just like SQL Statements
low_age = df[df['Age']<20]
low_age

    Name  Age     Sex
1   Pari   19  female
3  Rahul   19    male

### Find mean, Median and Mode, standard Deviation

In [27]:
df

      Name  Age     Sex
0  Saurabh   20    male
1     Pari   19  female
2   Rohini   22  female
3    Rahul   19    male

In [28]:
#The mean (average) of a data set is found by adding all numbers in the data set and then dividing by the number of values in the set. 
df.Age.mean()

20.0

In [29]:
#The median is the middle value when a data set is ordered from least to greatest.
df.Age.median()

19.5

In [30]:
#The mode is the number that occurs most often in a data set.
df.Age.mode()

0    19
dtype: int64

In [31]:
df.Age.std()

1.4142135623730951

In [33]:
#creating emply series
ser = pd.Series()
print(ser)

Series([], dtype: float64)

<ipython-input-33-e6bad121ff5c>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser = pd.Series()

In [35]:
#simple array
data = np.array(['m','i','g','u','h','g'])

ser =pd.Series(data)
print(ser)

0    m
1    i
2    g
3    u
4    h
5    g
dtype: object

In [36]:
# a simple list
list1 = ['e','d','g','b','k','p']

#creating series from a list
ser = pd.Series(list1)
print(ser)

0    e
1    d
2    g
3    b
4    k
5    p
dtype: object

In [38]:
# a simple dictionary
dict1 = {'Python': 10,
        'for':20,
        'Artificial':30,
        'Intelligent':50}
#create series from dictionary
ser = pd.Series(dict1)
print(ser)

Python         10
for            20
Artificial     30
Intelligent    50
dtype: int64

### How to read and work with files

In [52]:
readcsv = pd.read_csv("apy.csv")

In [49]:
readcsv.head()

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
0,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Rice,102.0,321.0
3,Andaman and Nicobar Islands,NICOBARS,2000,Whole Year,Banana,176.0,641.0
4,Andaman and Nicobar Islands,NICOBARS,2000,Whole Year,Cashewnut,720.0,165.0

In [50]:
#Task 1: Make all State_Name characters lowercase.
readcsv['State_Name'].str.lower()

0         andaman and nicobar islands
1         andaman and nicobar islands
2         andaman and nicobar islands
3         andaman and nicobar islands
4         andaman and nicobar islands
                     ...
246086                    west bengal
246087                    west bengal
246088                    west bengal
246089                    west bengal
246090                    west bengal
Name: State_Name, Length: 246091, dtype: object